Kanban1C/src/Tasks/ЗадачаПользователя/ЗадачаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаПользователя</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаРекодителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Task>

Kanban1C/src/InformationRegisters/СведенияОЗадачах/СведенияОЗадачах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОЗадачах</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадачи</types>
    </type>
  </resources>
  <resources>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>TaskRef.ЗадачаПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Kanban1C/src/Enums/СтатусыЗадачи/СтатусыЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадачи</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Исполнена</name>
  </enumValues>
</mdclass:Enum>

Kanban1C/src/Tasks/ЗадачаПользователя/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = Неопределено ИЛИ Объект.Автор = Справочники.Пользователи.ПустаяСсылка() Тогда 
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементовПриПервомОткрытии();
		
	Если Объект.Автор <> ПользователиКлиент.ТекущийПользователь() Тогда
		УстановитьДоступностьЭлементовДляИсполнителя();
	КонецЕсли;
	
	Если Объект.Автор = ПользователиКлиент.ТекущийПользователь() Тогда
		УстановитьДоступностьЭлементовДляАвтора();
	КонецЕсли;

	
	Если Объект.Выполнена Тогда
		 УстановитьДоступностьЭлементовКогдаВыполнена();
	КонецЕсли;
	
	
КонецПроцедуры  
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Выполнена И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.Исполнена") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.Исполнена"); 
		Отказ = Истина;
	КонецЕсли;                                                                           
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Задача записана");
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Описание) Тогда
		Объект.Описание = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ИсторияИзмененияЗадачи(Команда)
	Парам = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Задача", Объект.Ссылка);
	Парам.Вставить("Отбор", Отбор);     
	ОткрытьФорму("РегистрСведений.СведенияОЗадачах.ФормаСписка", Парам, ЭтотОбъект);
КонецПроцедуры
#КонецОбласти



#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьДоступностьЭлементовДляИсполнителя()
	Элементы.Наименование.Доступность = Ложь;
	Элементы.Описание.Доступность = Ложь;
	Элементы.Исполнитель.Доступность = Ложь;
	Элементы.Номер.Доступность = Ложь;
	Элементы.Дата.Доступность = Ложь;
	Элементы.СрокВыполнения.Доступность = Ложь;
	
КонецПроцедуры 

Процедура УстановитьДоступностьЭлементовКогдаВыполнена() 
	Элементы.Статус.Доступность = Ложь;
	Элементы.Наименование.Доступность = Ложь;
	Элементы.Описание.Доступность = Ложь;
	Элементы.Исполнитель.Доступность = Ложь;
	Элементы.Номер.Доступность = Ложь;
	Элементы.Дата.Доступность = Ложь;
	Элементы.СрокВыполнения.Доступность = Ложь;
КонецПроцедуры  

Процедура УстановитьДоступностьЭлементовДляАвтора() 
	Элементы.Статус.Доступность = Ложь;
	КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыполнить.Доступность = Ложь;
КонецПроцедуры 

Процедура УстановитьДоступностьЭлементовПриПервомОткрытии() 
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Статус.Доступность = Ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыполнить.Доступность = Ложь;
	Иначе
		Элементы.Статус.Доступность = Истина;
		КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыполнить.Доступность = Истина;
	КонецЕсли;  

КонецПроцедуры
#КонецОбласти
